Revit 2027 API
BuiltInFailures.StairRampFailures.WinderStraightStepsNumberFailure Property
 The current layout cannot allow the specified number of treads. Increase the length of the run leg in the model or reduce the value for Parallel Treads at Start or Parallel Treads at End.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderStraightStepsNumberFailure { get; }
Public Shared ReadOnly Property WinderStraightStepsNumberFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderStraightStepsNumberFailure {
	FailureDefinitionId^ get ();
}
static member WinderStraightStepsNumberFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace